import pandas as pd
from pyecharts import HeatMap
import numpy as np

df_job = pd.read_csv('data/response_JAVA_cleaned.csv', encoding='utf-8')
df = pd.DataFrame(columns=['edu_level', 'work_exp', 'mean'])
#数据清洗
df_job = df_job[~df_job['avg_salary'].isin([125000])]
df_job = df_job[~df_job['avg_salary'].isin([0])]
df_job = df_job[~df_job['company_name'].isin(['北京独创时代科技有限公司', '深圳市深为软件技术有限公司'])]
df_job = df_job[~df_job['company_loc'].isin(['武汉-洪山区'])]
df_job = df_job[~df_job['edu_level'].isin(['硕士'])]

#最低学历-工作经验->平均月薪
hM = HeatMap("最低学历及工作经验对应的平均月薪(0/不限, 1/无经验, 2/1年以下, 3/1-3年, 4/3-5年, 5/5-10年, 6/10年以上)", width=900)
# e_e_s = df_job.groupby(['edu_level', 'work_exp'])['avg_salary'].agg({"mean": np.mean})
'''                            
edu_level work_exp       mean       
不限        1-3年       8250.000000
    1年以下       5000.000000
    3-5年      10922.413793
    5-10年     22000.000000
    不限         6443.413174
    无经验        6777.777778
中专        1-3年       6416.666667
    1年以下       4958.333333
    3-5年      10250.000000
    不限         5249.387755
    无经验        4642.857143
中技        不限         5333.333333
    无经验        6000.000000
    大专        1-3年       8691.356674
    10年以上     24000.000000
    1年以下       6724.489796
    3-5年      12824.416342
    5-10年     16813.809524
    不限         6124.349776
    无经验        4825.352113
本科        1-3年       9903.214774
    10年以上     22000.000000
    1年以下       6597.222222
    3-5年      13978.266914
    5-10年     18832.324455
    不限         8514.347826
    无经验        6413.461538
'''

_x = ['不限', '中专', '中技', '大专', '本科']
_y = ['不限', '无经验', '1年以下', '1-3年', '3-5年', '5-10年', '10年以上']
data = [['不限', '1-3年', 8250], ['不限', '1年以下', 5000], ['不限', '3-5年', 10922], ['不限', '5-10年', 22000],
        ['不限', '不限', 6443], ['不限', '无经验', 6777], ['中专', '1-3年', 6416], ['中专', '1年以下', 4958],
        ['中专', '3-5年', 10250], ['中专', '不限', 5249], ['中专', '不限', 5249], ['中专', '无经验', 4642],
        ['中技', '不限', 5333], ['中技', '无经验', 6000], ['大专', '1-3年', 8691], ['大专', '10年以上', 24000],
        ['大专', '1年以下', 6724], ['大专', '3-5年', 12824], ['大专', '5-10年', 16813], ['大专', '不限', 6124],
        ['大专', '无经验', 4825], ['本科', '1-3年', 9903], ['本科', '10年以上', 22000], ['本科', '1年以下', 6597],
        ['本科', '3-5年', 13978], ['本科', '5-10年', 18832], ['本科', '不限', 8514], ['本科', '无经验', 6413]]
hM.add("", _x, _y, data, is_visualmap=True, visual_range=[1000, 25000], visual_text_color="#000", visual_orient='horizontal')
hM.render("三维.html")